Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: The work isn't over until the paperwork is done, and you're going to need to put in some time writing some documentation for your module.
es: No habrá acabado el trabajo hasta que tenga listo el papeleo. Tiene que dedicar algo de tiempo a escribir la documentación del módulo.

source: The work started in 2002 and is still ongoing.
es: El trabajo se inició en 2002 y sigue en curso.

source: Their existence allows Perl to keep the originally compiled behavior of a regular expression, regardless of what rules are in effect when it is actually executed.
es: Con ellos, Perl puede mantener el comportamiento originalmente compilado de una expresión regular, independientemente de las normas que estén en vigor cuando se ejecute dicha expresión.

source: Their usage in production code should be noted to avoid problems during upgrades.
es: Debe anotarse su uso en código de producción para evitar problemas al actualizar.

source: Then for each possible format character, we swallow up the other arguments in the pattern (a field width, an asterisk, and so on) and convert the next chunk input into the specified format, adding it onto the output SV C<cat>.
es: Luego, para cada carácter de formato posible, se consumen los demás argumentos del patrón (un ancho de campo, un asterisco, etc.) y se convierte el siguiente fragmento de entrada al formato especificado, agregándolo al SV de salida, C<cat>.

source: Then go on to declare and use your variables in functions without any qualifications.
es: A continuación, puede declarar y usar sus variables en funciones sin calificarlas.

source: Then it introduces several different OO systems from L<CPAN|http://search.cpan.org> which build on top of what Perl provides.
es: A continuación presenta varios sistemas diferentes de orientación a objetos, disponibles en L<CPAN|http://search.cpan.org>, construidos sobre la base proporcionada por Perl.

source: Then it will try to match C<(?!123)> with "123", which fails.
es: Después intenta asociar C<(?!123)> con "123", y no hay coincidencia.

source: Then make your changes.
es: A continuación, haga los cambios.

source: Then move the files (probably just the F<.pm> files, though there may be some additional ones, too; check the module documentation) to their final destination: This will most likely be in C<$ENV{MACPERL}site_lib:> (i.e., C<HD:MacPerl folder:site_lib:>).
es: A continuación, mueva los archivos (probablemente sólo los archivos F<.pm>, aunque puede que tenga que mover otros archivos; revise la documentación del módulo) hasta su destino final, que probablemente sea C<$ENV{MACPERL}site_lib:> (es decir, C<HD:Carpeta MacPerl:site_lib:>).

source: Then run the following script (or something like it):
es: A continuación, ejecute el siguiente script (o algo parecido):

source: Then type this to create the DESCRIP.MMS for the module:
es: A continuación, ejecute el comando siguiente para crear el archivo DESCRIP.MMS del módulo:

source: Then use it like:
es: Puede asignar el valor devuelto así:

source: Then you can merge it into master like this:
es: Después puede combinarla en la rama principal de esta manera:

source: Then you can pull, commit, merge and push as before.
es: Después podrá traer, confirmar, combinar y enviar, como antes.

source: Then you can use git directly to send your patch emails:
es: Después puede usar git directamente para enviar mensajes de correo electrónico con parches adjuntos:

source: Then you can use the modules from your Perl programs with C<use lib "/my/perl_directory/lib/site_perl";> or sometimes just C<use "/my/perl_directory";>.
es: Para poder usar estos módulos en sus programas Perl, debe agregar C<use lib "/mi/directorio_perl/lib/site_perl";> al principio del programa o, en algunos casos, simplemente C<use "/mi/directorio_perl";>.

source: Then you know exactly how many bytes it will be in the destination string.
es: Así podrá saber exactamente cuántos bytes hay en la cadena generada.

source: Then, Chip asked:
es: Un día, Chip preguntó:

source: There are other object orientation paradigms as well.
es: Hay otros paradigmas de orientación a objetos.

source: There are manpages documenting L<commands|/command>, L<syscalls|/syscall>, L</library> L<functions|/function>, L<devices|/device>, L<protocols|/protocol>, L<files|/file>, and such.
es: Existen páginas de manual que documentan L<comandos|/comando>, L<llamadas de sistema|/llamada de sistema>, L<funciones|/función> de L</biblioteca>, L<dispositivos|/dispositivo>, L<protocolos|/protocolo>, L<archivos|/archivo>, etc.

source: There are similar C<\p{...}> constructs that can match beyond ASCII both white space (see L<perlrecharclass/Whitespace>), and Posix classes (see L<perlrecharclass/POSIX Character Classes>).
es: Hay construcciones similares a C<\p{...}> que permiten detectar espacio en blanco (vea L<perlrecharclass/Espacio en blanco>) y clases Posix (vea L<perlrecharclass/Clases de caracteres POSIX>) más allá de ASCII.

source: There are a couple of special arrays too, such as C<@ARGV> (the command line arguments to your script) and C<@_> (the arguments passed to a subroutine).
es: También hay dos arrays especiales: C<@ARGV> (los argumentos de línea de comandos pasados al script) y C<@_> (los argumentos pasados a una subrutina).

source: There are a few basic principles which define object oriented Perl:
es: La orientación a objetos en Perl se define mediante unos pocos principios básicos:

source: There are a few platform-specific directories which contain C code.
es: Hay algunos directorios específicos de la plataforma que contienen código C.

source: There are a lot of modules on CPAN that can help you write safer and more concise code, including the modules we recommend in L<perlootut>.
es: Hay muchos módulos de CPAN (como los módulos recomendados en el documento L<perlootut>) que pueden ayudarle a escribir código más conciso y seguro.

source: There are a lot of modules on CPAN, and it's easy to miss one that's similar to what you're planning on contributing.
es: En CPAN hay muchos módulos, por lo que es fácil pasar por alto alguno similar al que pretende publicar.

source: There are a number of "magic" scalars with names that look like punctuation or line noise.
es: Hay varios escalares "mágicos" con nombres que recuerdan conjuntos de signos de puntuación (o "ruido de señal").

source: There are a number of Unicode characters that match multiple characters under C</i>.
es: Con el modificador C</i> activado, hay varios caracteres Unicode que coinciden con secuencias de caracteres (caracteres múltiples).

source: There are a number of issues with regard to case-insensitive matching in Unicode rules.
es: Hay una serie de problemas relacionados con la coincidencia de mayúsculas y minúsculas en las reglas de Unicode.

source: There are a set of utilities which help you in developing Perl programs, and in particular, extending Perl with C.
es: A continuación se describe un conjunto de utilidades que ayudan a desarrollar programas Perl y, en particular, a extender Perl con código C.

source: There are actually three execute bits under Unix, and which bit gets used depends on whether you own the file singularly, collectively, or not at all.
es: En realidad hay tres bits de ejecución en Unix, y el que se usa dependerá de si usted es el único propietario del archivo, si forma parte de un grupo de propietarios, o si no es propietario del archivo.

source: There are actually two varieties of null strings (sometimes referred to as "empty" strings), a defined one and an undefined one.
es: En realidad hay dos variantes de cadena nula (a las que algunas veces llamamos cadenas "vacías"): una definida y otra indefinida.

source: There are also many other sub-domains for special topics like learning Perl and jobs in Perl, such as:
es: Además, existen muchos subdominios dedicados a temas específicos, como el aprendizaje de Perl, o anuncios de puestos de trabajo para programadores Perl. Por ejemplo:

source: There are also plenty of Perl related newsgroups located under C<comp.lang.perl.*>.
es: También encontrará muchos grupos de noticias relacionados con Perl en C<comp.lang.perl.*>.

source: There are also several utilities which are used by the Perl distribution itself as part of the install process.
es: algunas de ellas se usan durante el proceso de instalación de la distribución.

source: There are basically three categories of modules that will not work "out of the box" with all platforms (with some possibility of overlap):
es: Hay básicamente tres tipos de módulos que no funcionan en todas las plataformas sin acciones adicionales (es posible que estos tipos se solapen):

source: There are four steps you must now take:
es: A continuación debe realizar cuatro pasos:

source: There are literally dozens of other OO-related modules on CPAN besides those covered here, and you're likely to run across one or more of them if you work with other people's code.
es: En CPAN encontrará decenas de módulos relacionados con la orientación a objetos, además de los considerados aquí; es posible que se encuentre con varias de estas alternativas si trabaja con código de otras personas.

source: There are lots of good reasons for this.
es: Hay muchas razones de peso para ello.

source: There are many Perl L<mailing lists|lists.perl.org> for various topics, specifically the L<beginners list|http://lists.perl.org/list/beginners.html> may be of use.
es: Existen muchas L<listas de correo|lists.perl.org> sobre diversos temas relacionados con Perl. En concreto, la L<lista para principiantes|http://lists.perl.org/list/beginners.html> puede resultar útil cuando se empieza.

source: There are many Perl-related websites, so only a few of the community's largest are mentioned here.
es: Hay muchos sitios web relacionados con Perl, por lo que aquí solo se mencionan algunos de los más importantes de la comunidad.

source: There are many books on Perl and Perl-related.
es: Hay muchos libros sobre Perl o relacionados con Perl.

source: There are many good L<books on Perl|http://www.perl.org/books/library.html>.
es: Se han publicado muchos L<libros sobre Perl|http://www.perl.org/books/library.html> de gran calidad.

source: There are many, many code points, but computers work with bytes, and a byte has room for only 256 values.
es: Hay muchísimos códigos de carácter, pero el hardware trabaja con bytes, y un byte sólo puede representar 256 valores.

source: There are more Unicode encodings, but much of the world has standardized on UTF-8.
es: Hay otras codificaciones de Unicode, pero UTF-8 se está convirtiendo en la codificación estándar.

source: There are no relative packages: all symbols are either local to the current package, or must be fully qualified from the outer package name down.
es: No hay paquetes relativos: todos los símbolos deben ser locales con respecto al paquete actual o deben aparecer completamente calificados, comenzando por el paquete más externo.

source: There are probably very nice books published after this list was included in your Perl release, and you can check the latest released version at http://perldoc.perl.org/perlbook.html .
es: Es probable que se hayan publicado libros muy interesantes desde que se incluyó la lista en esta versión de Perl. Si lo desea, puede consultar la versión más reciente de la lista en http://perldoc.perl.org/perlbook.html .

source: There are quite a few systems out there that do worse!
es: En muchos sistemas los resultados obtenidos son peores...

source: There are rare cases where this package-based resolution can be a problem.
es: Hay casos especiales en los que la resolución basada en paquetes puede ser problemática.

source: There are really two tracks of perl development: a maintenance version and an experimental version.
es: Hay dos líneas de desarrollo de perl: una versión de mantenimiento y una versión experimental.

source: There are several examples below that illustrate these perils.
es: Hay varios ejemplos a continuación que ilustran estos peligros.

source: There are several great resources for locating workshops: the L<websites|"Websites"> mentioned above, the L<calendar|"Calendar of Perl Events"> mentioned below, and the YAPC Europe website, L<http://www.yapceurope.org/>, which is probably the best resource for European Perl events.
es: Tiene a su disposición varios recursos muy útiles para encontrar talleres: los L<Sitios web|"Sitios web"> mencionados anteriormente, el L<calendario|"Calendario de eventos Perl"> que se menciona más adelante y el sitio web de YAPC Europe, L<http://www.yapceurope.org/>, que es probablemente el mejor recurso para los eventos Perl en Europa.

source: There are some shortcuts for oneliners; see L<-C|perlrun/-C [numberE<sol>list]> in L<perlrun>.
es: Existen algunos métodos abreviados para scripts de una línea (I<one-liners>); vea la descripción del modificador L<-C|perlrun/-C [numberE<sol>list]> en L<perlrun>.

source: There are still some bits and pieces hanging around in here that need to be moved.
es: Aún quedan cosas que deben moverse a otra parte.

source: There are too many modules, and too few Orwants, for me to be able to answer or even acknowledge all your questions.
es: Hay demasiados módulos y muy pocos Orwants; no puede resolver, ni tan siquiera contestar, todas las dudas.

source: There are two common types of accessors, read-only and read-write.
es: Hay dos tipos comunes de métodos de acceso: de solo lectura y de lectura y escritura.

source: There are two major contexts: list and scalar.
es: Hay dos tipos principales de contexto: lista y escalar.

source: There are two types of character class tests that Perl implements: one type deals in C<char>s and are thus B<not> Unicode aware (and hence deprecated unless you B<know> you should use them) and the other type deal in C<UV>s and know about Unicode properties.
es: Perl implementa dos tipos de pruebas de clases de caracteres: las de un tipo usan variables C<char> y, por tanto, B<no> son compatibles con Unicode (y, en consecuencia, son obsoletas a menos que B<esté seguro> de que debe usarlas) y las del otro tipo usan variables C<UV> y saben lo que son las propiedades Unicode.

source: There are, however, extension L<modules|/module> to get Perl to act more like a "real" compiler.
es: Sin embargo, existen L<módulos|/módulo> de extensión que hacen que Perl se parezca más a un compilador "real".

source: There have been some complaints that it should restore the UTF8 flag when the data is read again with C<eval>.
es: Algunas personas se han quejado de que no restaura la marca UTF8 cuando se vuelven a leer los datos con C<eval>.

source: There is a bug in FreeBSD's C<readdir_r> function in versions 4.5 and earlier that can cause a SEGV when reading large directories.
es: En las versiones 4.5 y anteriores de FreeBSD existe un error en la función C<readdir_r> que provocará un SEGV si se leen directorios grandes.

source: There is a central directory for the Perl community: L<http://perl.org> maintained by the Perl Foundation (L<http://www.perlfoundation.org/>), which tracks and provides services for a variety of other community sites.
es: Existe un directorio central para la comunidad Perl, L<http://perl.org>, mantenido por la Fundación Perl (The Perl Foundation, L<http://www.perlfoundation.org/>), que además de prestar servicios a diversos sitios web de la comunidad, realiza un seguimiento de los mismos.

source: There is a list of these books, some with extensive reviews, at http://books.perl.org/ . We list some of the books here, and while listing a book implies our endorsement, don't think that not including a book means anything.
es: En http://books.perl.org/ encontrará una lista de libros y extensas reseñas. En este documento se hace referencia a algunos de estos libros. Los que figuran en la lista son libros que recomendamos; no obstante, el que un libro no figure en la lista no quiere decir que sea malo.

source: There is a rich ecosystem of C<Moose> extensions on CPAN under the L<MooseX|http://search.cpan.org/search?query=MooseX&mode=dist> namespace.
es: Existe un variado ecosistema de extensiones de C<Moose> en CPAN, en el espacio de nombres L<MooseX|http://search.cpan.org/search?query=MooseX&mode=dist>.

source: There is a separate symbol table for each L</package> to give each package its own L</namespace>.
es: Existe una tabla de símbolos independiente para cada L</paquete>, a fin de asignar a cada paquete su propio L</espacio de nombres>.

source: There is a special form of this construct, called C<\K>, which causes the regex engine to "keep" everything it had matched prior to the C<\K> and not include it in C<$&>.
es: Esta construcción tiene una forma especial, llamada C<\K>, que hace que el motor de expresiones regulares "omita" todo lo que haya antes de C<\K> y no lo incluya en C<$&>.

source: There is a very large and supportive user community and an extensive literature.
es: Tiene una gran comunidad de usuarios y existe mucha información sobre el lenguaje.

source: There is an incompatibility in OpenBSD's C<getprotobyname_r> and C<getservbyname_r> function in versions 3.7 and later that will cause a SEGV when called without doing a C<bzero> on their return structs prior to calling these functions.
es: En las versiones 3.7 y posteriores de OpenBSD existe una incompatibilidad en las funciones C<getprotobyname_r> y C<getservbyname_r> que provocará un SEGV si se llama a estas funciones sin haber aplicado antes la función C<bzero> a sus estructuras de retorno.

source: There is no Perl 6 release scheduled, but it will be available when it's ready.
es: Aún no está prevista una fecha de lanzamiento de Perl 6. La nueva versión estará disponible cuando llegue el momento.

source: There is no double interpolation in Perl, so the C is left as is.
es: No hay doble interpolación en Perl, por lo que C queda tal como está.

source: There is no equivalent to C<fgets>; one should use C<sv_gets> instead:
es: No existe nada equivalente a C<fgets>; en su lugar, debe usar C<sv_gets>:

source: There is no need to pre-declare your variable types, but you have to declare them using the C<my> keyword the first time you use them.
es: No es necesario predeclarar los tipos de las variables, pero éstas deben declararse con la palabra clave C<my> la primera vez que se usan.

source: There is no need to have a C<main()> function or anything of that kind.
es: Es decir, no es necesario utilizar una función C<main()> ni nada similar.

source: There is no special class syntax in Perl, but a package may act as a class if it provides subroutines to act as methods.
es: No hay una sintaxis especial para clases en Perl, pero un paquete puede actuar como una clase si proporciona subrutinas que se comportan como métodos.

source: There is no way to reliably detect the encoding automatically, so if people keep sending you data without charset indication, you may have to educate them.
es: No existe una manera fiable de detectar automáticamente la codificación, por lo que es mejor enseñar a las personas que le suministran datos a indicar el juego de caracteres utilizado.

source: There is often a matter of opinion and taste, and there isn't any one answer that fits everyone.
es: Esto suele ser una cuestión de opinión y gusto, y no hay una respuesta definitiva para todos.

source: There is one subtle difference between the following statements:
es: Existe una sutil diferencia entre las instrucciones siguientes:

source: There is only a single C<%^H>, but arbitrarily many modules that want to use its scoping semantics.
es: Solo hay un único hash C<%^H>, pero puede haber muchos módulos que deseen usar su semántica de definición de ámbito.

source: There may be 0, 1, or several different ways that the definition might succeed against a particular string.
es: Puede ser 0, 1 u otras formas diferentes para las que la definición puede obtener una coincidencia con una cadena de caracteres determinada.

source: There were a number of inconsistencies (bugs) with the C</d> modifier, where Unicode rules would be used when inappropriate, and vice versa.
es: Había varias incoherencias (errores) relacionadas con el uso del modificador C</d>: se usaban las reglas de Unicode cuando no era adecuado hacerlo, y viceversa.

source: There's really no good reason to write your classes from scratch in Perl.
es: No hay ninguna razón para empezar a escribir clases desde cero.

source: There's More Than One Way To Do It, the Perl Motto.
es: I<There's More Than One Way To Do It> (Se puede hacer de varias maneras), el lema de Perl.

source: There's a lot of speculation here.
es: En gran parte nos hemos basado en especulaciones.

source: There's a lot to know about character sets, and text encodings.
es: Hay mucho que aprender sobre juegos de caracteres y codificaciones de texto.

source: There's also I<$foo Magazin>, a German magazine dedicated to Perl, at ( L<http://www.foo-magazin.de> ).
es: I<$foo Magazin> ( http://www.foo-magazin.de ) es una revista dedicada a Perl, escrita en alemán.

source: There's also a "don't care" scalar context (which is dealt with in Programming Perl, Third Edition, Chapter 2, "Bits and Pieces" if you care).
es: También existe un contexto escalar "indiferente" (si siente curiosidad, se describe como el contexto "don't care" en el Capítulo 2, "Bits and Pieces", de la tercera edición de Programming Perl).

source: There's also a negated version of it:
es: También existe la versión negada:

source: There's also a negated version, for the same reason we have C<unless>:
es: Existe también una versión negada, por la misma razón que existe C<unless>:

source: There's no place to declare a scalar variable to be of type "string", type "number", type "reference", or anything else.
es: No hay ninguna forma de declarar que una variable escalar sea de tipo "cadena", "número", "referencia" o cualquier otra cosa.

source: Therefore, C<(0|0x)\d*\s\g1\d*> will match "0x1234 0x4321", but not "0x1234 01234", because subpattern 1 matched "0x", even though the rule C<0|0x> could potentially match the leading 0 in the second number.
es: Por lo tanto, C<(0|0x)\d*\s\g1\d*> coincidirá con "0x1234 0x4321", pero no con "0x1234 01234", debido a que el subpatrón 1 detectó "0x", aunque la regla C<0|0x> podría detectar el 0 inicial del segundo número.

source: Therefore, if a module's name is, say, C<Text::Soundex>, then its definition is actually found in the library file F<Text/Soundex.pm>.
es: Así, si el nombre del módulo es, por ejemplo, C<Text::Soundex>, su definición se ubicará en el archivo de biblioteca F<Text/Soundex.pm>.

source: These differences can be either positive (e.g. extensions for the features of the particular platform that are not supported in the source release of perl) or negative (e.g. might be based upon a less current source release of perl).
es: Estas diferencias pueden ser positivas (p. ej., extensiones para las características de una plataforma específica que no se ofrecen en la distribución de código fuente de perl) o negativas (p. ej., la distribución binaria puede estar basada en una distribución de código fuente de perl menos reciente).

source: These statements are simply written in the script in a straightforward fashion.
es: Estas instrucciones se escriben directamente en el script.

source: These are alternate syntaxes for C<decode('utf8', ...)> and C<encode('utf8', ...)>.
es: Ofrecen una sintaxis alternativa a C<decode('utf8', ...)> y C<encode('utf8', ...)>.

source: These are disallowed under C</l>.
es: Con C</l> no se permiten.

source: These are documented at great length in L<perlre>, but for the meantime, here's a quick cheat sheet:
es: Estas se describen de forma detallada en L<perlre>. A continuación se incluye una guía rápida:
